app/controllers/dashboard/codes_controller.rb

UPDATE "users" SET "code" = 'V324', "updated_at" = '2011-06-07 17:16:07.133862' WHERE "users"."id" = 1
---
  def create
    @user = current_user
    @user.code = params[:user][:code] rescue nil
    if @user.save