app/controllers/dashboard/contacts_controller.rb

  def show
    @contact =  current_user.contacts.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = 1 AND ("contacts".user_id = 6) LIMIT 1

  def create
    if verify_recaptcha
      if params[:shareme_code].present? && (@user = User.find_by_code(params[:shareme_code]))
        @contact = current_user.add_contact(@user)
        redirect_to dashboard_contact_path(@contact), :notice => I18n.t("dhb.contacts.create.success")
---
SELECT "users".* FROM "users" WHERE "users"."code" = 'WNVE' LIMIT 1
INSERT INTO "contacts" ("user_id", "name", "email", "associated_user_id", "created_at", "updated_at") VALUES (6, 'Naveed Tariq', 'naved.tariq@gmail.com', 5, '2011-06-07 18:09:06.645137', '2011-06-07 18:09:06.645137')