app/controllers/dashboard/maps_controller.rb

SELECT "contacts".* FROM "contacts" WHERE ("contacts".user_id = 1)
---
  def index
    @contacts =  current_user.contacts
    @contacts_data =  @contacts.map{ |v| { :address => v.associated_user.try(:address),
        :info => google_usercart(v.associated_user),
        :name => (v.associated_user.try(:full_name)||v.name),
        :url => dashboard_contact_path(v)}}