app/controllers/dashboard/users_controller.rb

UPDATE "users" SET "encrypted_address" = 'UI71mEFaSNkgN45bCVTyKw==
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])