app/controllers/confirmations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = 'aSFbbtAjpV2iCRq1mYxp' LIMIT 1
---
  def show
    if params[:confirmation_token]
      @user = User.find_by_confirmation_token(params[:confirmation_token])