app/controllers/omniauth_callbacks_controller.rb

  def set_omniauth_data
    self.omniauth_data = env["omniauth.auth"]
    self.preexisting_authorization_token = UserToken.find_by_provider_and_uid(omniauth_data['provider'], omniauth_data['uid'])
---
SELECT "user_tokens".* FROM "user_tokens" WHERE "user_tokens"."provider" = 'facebook' AND "user_tokens"."uid" = '668328382' LIMIT 1