app/controllers/registrations_controller.rb

  def finish
    @user = current_user
    if request.put? && @user.update_attributes(params[:user]) && @user.filled! && sign_in( @user, :bypass => true )
---
UPDATE "users" SET "filled" = 't', "updated_at" = '2011-06-07 16:52:41.422796' WHERE "users"."id" = 1