app/controllers/shareme_controller.rb

SELECT "users".* FROM "users" WHERE "users"."code" = 'adsf' LIMIT 1
---
  def show
    session[:shareme_code] = session[:connect_user_id] = nil
    if params[:code]
      if @user = User.find_by_code(params[:code])