app/controllers/dashboard/import_contacts/facebook_controller.rb

UPDATE "users" SET "first_signin_fb" = 'f', "updated_at" = '2011-06-14 05:24:51.784085' WHERE "users"."id" = 17
---
  def friends
    if auth_params[:email].present? && auth_params[:password].present? &&
        ( @import_contact = ImportContact::Facebook.new(current_user, { :cookies => cookies }) )
      if @import_contact.auth?
        if ImportContact::Facebook.auth_mechanize?(auth_params)
          @friends = @import_contact.friends
          if request.xhr?
            debugger
            current_user.update_attribute(:first_signin_fb, false)

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
---
  def imports
	puts params.inspect + "--------------------"
    if params[:users].present?
      @contacts = ImportContact::Facebook.import(current_user, {
                                                   :password => auth_params[:password],
                                                   :email => auth_params[:email], :contact_uids => params[:users]
                                                 })
      session.delete(:import_contact_params)
      flash.notice = "Contacts imported."
    else
      redirect_to dashboard_contacts_path, :notice => "Not selected contacts."
    end
    @contacts.each do |c|
      User.find_by_id(c[0].id).invite!

SELECT "users".* FROM "users" WHERE "users"."id" = 10 LIMIT 1
---
  def invite
    if params[:users].present?
      User.where(:id => params[:users]).map{ |v| v.invite!}